PH_data/alpha_1.35/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
23276
(
( 0.0002182028838 6.183929031e-07 1.021034586e-05 )
( 0.0004963345127 1.502056762e-06 2.235883767e-05 )
( 0.0002218905429 6.241547226e-07 1.02650738e-05 )
( 0.0009481298621 4.189384981e-06 4.092277595e-05 )
( 0.0005040932447 1.485391522e-06 2.247162411e-05 )
( 0.0002254586288 6.317588372e-07 1.033802528e-05 )
( 0.001540098572 9.377096831e-06 6.321313413e-05 )
( 0.0009615616291 4.12467034e-06 4.108761641e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
